# ClassificationEntries Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ClassificationEntries Properties
ClassificationEntries Class See Also
---
The ClassificationEntries type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from KeyBasedTreeEntries.) |

# See Also
ClassificationEntries Class
Autodesk.Revit.DB Namespace